[
  {
    "id": 1,
    "q": "Complete the flowchart to calculate the sum of two numbers.  Add 10 and 20. Here is the description of the given flowchart. The flowchart that we have given to you is given in 6 steps and the first one is a terminal symbol, and it is mentioned as start. Second, sum = 0 is initialized in the Process Symbol. Thirdly, the numbers 10 and 20 are entered in the Input Symbol.  Fourth place of the flowchart is blank box, and you should find the answer from given answers. The fifth Output Symbol has Print sum in it. The sixth terminal symbol has Stop in it and the flowchart is finished. Find the answer for 4th block.",
    "a1": "sum = 10 + 20",
    "a2": "sum = 10 – 20",
    "a3": "sum = 10 / 20",
    "a4": "sum = 20",
    "r": 1,
    "useImage": true,
    "useTimeLimit": false,
    "timeLimit": 15,
    "useMCQAnswers": true,
    "useSpeechAnswer": true,
    "useVideoAnswer": false,
    "useRadioSelect": true,
    "useAiResponse": true
  },
  {
    "id": 2,
    "q": "Complete the flow chart to print “Hello World’ 10 times. Here is the description of the given flowchart. In this flow chart there are 6 steps. The first one is a terminal symbol, and it is mentioned as start. The second one is the process symbol and set the count variable to zero. In the third step there is a input symbol and print “Hello World”. In fourth one is a process symbol and increment count by 1. i.e., count = count + 1. The fifth symbol is a blank decision symbol and find the correct answer from given answers. If this is TRUE, then again print “Hello World” and increment the variable count in step 3. On the other hand, in the sixth step if the condition is FALSE then flowchart will stop with terminal symbol.",
    "a1": "Is count >10",
    "a2": "Is count <10",
    "a3": "Is count = 0",
    "a4": "Is count =10",
    "r": 2,
    "useImage": true,
    "useTimeLimit": false,
    "timeLimit": 15,
    "useMCQAnswers": true,
    "useSpeechAnswer": true,
    "useVideoAnswer": false,
    "useRadioSelect": true,
    "useAiResponse": true
  },
  {
    "id": 3,
    "q": "Draw a flow chart to find the area of rectangle. Here is the description of the given flowchart. In this flowchart have 5 steps. The first one is a terminal symbol, and it is mentioned as start. In the second step there is a input symbol and get the length as l and width as b. In thirdly calculate area = l multiplying b in process symbol. In the fourth step is a blank and it is an output symbol. The fifth terminal symbol has Stop in it and the flowchart is finished.",
    "a1": "Print length",
    "a2": "Print width",
    "a3": "Print Area",
    "a4": "Print length + width",
    "r": 3,
    "useImage": true,
    "useTimeLimit": false,
    "timeLimit": 15,
    "useMCQAnswers": true,
    "useSpeechAnswer": true,
    "useVideoAnswer": false,
    "useRadioSelect": true,
    "useAiResponse": true
  },
  {
    "id": 4,
    "q": "Draw a flowchart to check if a given number is even or odd. Here is the description of the given flowchart. In this flowchart have 5 steps. The first one is a terminal symbol, and it is mentioned as start. In the second step there is an input symbol and enter the number as input. In the third step is a blank and it is a decision symbol. Then as fourth step if yes it should print even or if no print odd in output symbol.  The fifth terminal symbol has Stop in it and the flowchart is finished.",
    "a1": "If Number%2 == 0",
    "a2": "If Number%3 ==0",
    "a3": "If Number%3 ==1",
    "a4": "If Number%2 == 1",
    "r": 1,
    "useImage": true,
    "useTimeLimit": false,
    "timeLimit": 15,
    "useMCQAnswers": true,
    "useSpeechAnswer": true,
    "useVideoAnswer": false,
    "useRadioSelect": true,
    "useAiResponse": true
  },
  {
    "id": 5,
    "q": "Complete the flow chart to check positive or negative numbers. Here is the description of the given flowchart. In this flowchart have 5 steps. The first one is a terminal symbol, and it is mentioned as start. In the second step there is a input symbol and get the number as input. In the third step is a blank and it is a decision symbol. Find the answer from the given answers. Then as fourth step if yes it should print positive or if no print negative in output symbol.  The fifth terminal symbol has Stop in it and the flowchart is finished.",
    "a1": "Is number = 0",
    "a2": "Is number ==0",
    "a3": "Is number < 0",
    "a4": "Is number > 0",
    "r": 4,
    "useImage": true,
    "useTimeLimit": false,
    "timeLimit": 15,
    "useMCQAnswers": true,
    "useSpeechAnswer": true,
    "useVideoAnswer": false,
    "useRadioSelect": true,
    "useAiResponse": true
  },
  {
    "id": 6,
    "q": "Complete the Flowchart to check the greatest of two numbers. Here is the description of the given flowchart. In this flowchart have 5 steps. The first one is a terminal symbol, and it is mentioned as start. In the second step there is an input symbol and get the two numbers A and B as input. In the third step is a blank and it is a decision symbol. Find the correct answer from the given answers. Then as fourth step if condition is true, it should print A as greatest or if no print B as greatest in output symbol.  The fifth terminal symbol has Stop in it and the flowchart is finished.",
    "a1": "Is A<B",
    "a2": "Is A>B",
    "a3": "Is A= B",
    "a4": "A",
    "r": 2,
    "useImage": true,
    "useTimeLimit": false,
    "timeLimit": 15,
    "useMCQAnswers": true,
    "useSpeechAnswer": true,
    "useVideoAnswer": false,
    "useRadioSelect": true,
    "useAiResponse": true
  },
  {
    "id": 7,
    "q": "Complete the Flowchart to calculate the circumference of circle. Here is the description of the given flowchart. In this flowchart have 5 steps. The first one is a terminal symbol, and it is mentioned as start. In the second step there is an input symbol and get the radius as r. In thirdly circumference of circle = 2 multiplying 3.14 multiplying r in process symbol. In the fourth step is a blank and it is an output symbol. The fifth terminal symbol has Stop in it and the flowchart is finished.",
    "a1": "Print Area",
    "a2": "Print circumference, Area",
    "a3": "Print circumference",
    "a4": "0",
    "r": 3,
    "useImage": true,
    "useTimeLimit": false,
    "timeLimit": 15,
    "useMCQAnswers": true,
    "useSpeechAnswer": true,
    "useVideoAnswer": false,
    "useRadioSelect": true,
    "useAiResponse": true
  },
  {
    "id": 8,
    "q": "Complete the Flowchart to check leap year or not. Here is the description of the given flowchart. In this flowchart have 5 steps. The first one is a terminal symbol, and it is mentioned as start. In the second step there is a input symbol and enter the year as input. In the third step is a blank and it is a decision symbol. Find the correct answer from the given answers. Then as fourth step if yes it should print leap or if no print does not leap in output symbol.  The fifth terminal symbol has Stop in it and the flowchart is finished.",
    "a1": "Year % 4== 0",
    "a2": "Year + 4 ==0",
    "a3": "Year - 4 == 0",
    "a4": "Year == 0",
    "r": 1,
    "useImage": true,
    "useTimeLimit": false,
    "timeLimit": 15,
    "useMCQAnswers": true,
    "useSpeechAnswer": true,
    "useVideoAnswer": false,
    "useRadioSelect": true,
    "useAiResponse": true
  },
  {
    "id": 9,
    "q": "Complete the Flowchart to convert Celsius to Fahrenheit. Here is the description of the given flowchart. The flowchart that we have given to you is given in 6 steps and the first one is a terminal symbol, and it is mentioned as start. In Second step, Celsius = 0 and Fahrenheit =0 is initialized in the Process Symbol. Thirdly, enter Celsius in the Input Symbol.  Fourth place of the flowchart is blank box, and you should find the answer from given answers. The fifth Output Symbol has Print Fahrenheit in it. The sixth terminal symbol has Stop in it and the flowchart is finished. Find the answer for 4th block.",
    "a1": "Fahrenheit = (1.8 +) +32",
    "a2": "Fahrenheit = (1.8 + Celsius) -32",
    "a3": "Fahrenheit = (1.8 - Celsius) +32",
    "a4": "Fahrenheit = (1.8 * Celsius) +32",
    "r": 1,
    "useImage": true,
    "useTimeLimit": false,
    "timeLimit": 15,
    "useMCQAnswers": true,
    "useSpeechAnswer": true,
    "useVideoAnswer": false,
    "useRadioSelect": true,
    "useAiResponse": true
  },
  {
    "id": 10,
    "q": "Complete the Flowchart to convert the length in feet to centimeters. Here is the description of the given flowchart. The flowchart that we have given to you is given in 5 steps and the first one is a terminal symbol, and it is mentioned as start. In Second step input length in feet in the input Symbol. In the third step of the flowchart is blank box, and you should find the answer from given answers. The fourth step is Output Symbol has Print length in centimeters. The fifth terminal symbol has Stop in it and the flowchart is finished. Find the answer for the 3rd block.",
    "a1": "Length_ centimeters = length_feet *30",
    "a2": "Length_ centimeters = length_feet *3",
    "a3": "Length_ centimeters = length_feet +30",
    "a4": "Length_ centimeters = length_feet - 30",
    "r": 2,
    "useImage": true,
    "useTimeLimit": false,
    "timeLimit": 15,
    "useMCQAnswers": true,
    "useSpeechAnswer": true,
    "useVideoAnswer": false,
    "useRadioSelect": true,
    "useAiResponse": true
  }
]
